#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Reading...
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
module.dev.data.archive_file.http_function_source["gif"]: Reading...
module.dev.data.archive_file.pubsub_function_source["stm"]: Reading...
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=b9c78aa296e3992a534329ee12e9400c1db846c2]
module.dev.data.archive_file.http_function_source["go"]: Reading...
module.dev.data.archive_file.pubsub_function_source["exp"]: Reading...
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=0670e2955e9f86836446bb766bcd64a84f94db45]
module.dev.data.archive_file.http_function_source["gif"]: Read complete after 0s [id=ade2bf534a1bf94beac9b4924ebb04d92f75a7a3]
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=70bbdeada9ccdbd989dadcb475dd9947b0cc95c6]
module.dev.data.archive_file.pubsub_function_source["stm"]: Read complete after 0s [id=588825a226b222d0f973e60ed5afbcd00abf6af4]
module.dev.data.archive_file.http_function_source["go"]: Read complete after 0s [id=ca54a48bb5d689229b9e2ee441ea2611944ae713]
module.dev.data.archive_file.http_function_source["merch"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Reading...
module.dev.data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=3b63dbff8ec0fde6c28727f84ce814edcab313f9]
module.dev.data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=2ac77fd164c9303aa5a90d42c11499d849d35e0c]
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=fea4d40761f0c4d7e4ade9234aff3c676d56b179]
module.dev.data.archive_file.http_function_source["level"]: Reading...
module.dev.data.archive_file.http_function_source["answer"]: Reading...
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Read complete after 0s [id=ba45a2283b0dfbb4403df49a975ffab286eb54ed]
module.dev.data.archive_file.http_function_source["java"]: Reading...
module.dev.data.archive_file.http_function_source["video"]: Reading...
module.dev.data.archive_file.http_function_source["level"]: Read complete after 0s [id=86266b212ea30aedbd643f308be80bb12d0a5fd6]
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
module.dev.data.archive_file.http_function_source["froge"]: Reading...
module.dev.data.archive_file.http_function_source["help"]: Reading...
module.dev.data.archive_file.http_function_source["answer"]: Read complete after 0s [id=8b80284449bbb05d35213a8902759f621d90f823]
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=c97bdc87edf3230c7f079530555818a0473cc8a2]
module.dev.data.archive_file.http_function_source["froge"]: Read complete after 0s [id=3cc29d594cea4df8c8f6af667a222fd97647a685]
module.dev.data.archive_file.http_function_source["js"]: Reading...
module.dev.data.archive_file.http_function_source["http"]: Reading...
module.dev.data.archive_file.http_function_source["src"]: Reading...
module.dev.data.archive_file.http_function_source["js"]: Read complete after 0s [id=358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7]
module.dev.data.archive_file.http_function_source["exam"]: Reading...
module.dev.data.archive_file.http_function_source["warn"]: Reading...
module.dev.data.archive_file.http_function_source["video"]: Read complete after 0s [id=428553a64384a42bd7c9e918bd72bb240172e07d]
module.dev.data.archive_file.http_function_source["hello"]: Reading...
module.dev.data.archive_file.http_function_source["help"]: Read complete after 0s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
module.dev.data.archive_file.http_function_source["exam"]: Read complete after 0s [id=de84a649e65565d61e8a1a7a1a7d53dff2f906e0]
module.dev.data.archive_file.http_function_source["java"]: Read complete after 0s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
module.dev.data.archive_file.http_function_source["src"]: Read complete after 0s [id=d283a62085b3665676857075d5397e051990724b]
module.dev.data.archive_file.http_function_source["leaderboard"]: Reading...
module.dev.data.archive_file.http_function_source["http"]: Read complete after 0s [id=c221dc2f104f758030579ea39e14ee1746c73f73]
module.dev.data.archive_file.http_function_source["flag"]: Reading...
module.dev.data.archive_file.http_function_source["warn"]: Read complete after 0s [id=23711e28cc000cf97afea64131ad0b918084cc7e]
module.dev.data.archive_file.http_function_source["hello"]: Read complete after 0s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
module.dev.data.archive_file.http_function_source["describe"]: Reading...
module.dev.data.archive_file.http_function_source["flag"]: Read complete after 0s [id=3c324e538a1c52e11b42bf3fdd2e95c1c00a5783]
module.dev.data.archive_file.http_function_source["ban"]: Reading...
module.dev.data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=a793316da15897fe031a9c29bc977344a76cf676]
module.dev.data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
module.dev.data.archive_file.http_function_source["ban"]: Read complete after 0s [id=87b0639e469a259184e4476cecc809db187ff634]
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 0s [id=f9f02508910a5e23f3b8de2947ed1f573d4ed654]
module.dev.google_secret_manager_secret.secret-basic["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
module.dev.google_secret_manager_secret.secret-basic["STM_API_KEY"]: Refreshing state... [id=projects/archy-f06ed/secrets/STM_API_KEY]
module.dev.google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
module.dev.google_storage_bucket.froge: Refreshing state... [id=froge-public-bucket-dev]
module.dev.google_secret_manager_secret.secret-basic["YOUTUBE_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN]
module.dev.google_logging_project_sink.cloud_function_error_sink: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-error-dev]
module.dev.google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function-dev]
module.dev.google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
module.dev.google_logging_project_sink.cloud_function_crud_sing: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-crud-dev]
module.dev.google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_channel_message_discord]
module.dev.google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_private_message_discord]
module.dev.google_pubsub_topic.pubsub_topic["stm_status"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_stm_status]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_error_log]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_crud_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_crud_log]
module.dev.google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_exp_discord]
module.dev.google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_froge_of_the_day]
module.dev.google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_update_user_role]
module.dev.google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_generate_welcome_image]
module.dev.google_storage_bucket_access_control.public_rule: Refreshing state... [id=froge-public-bucket-dev/allUsers]
module.dev.google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-dev-src-f9f02508910a5e23f3b8de2947ed1f573d4ed654.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudDeploymentLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-f5e0c278783c73ab95d630022ac487fe5e220188.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-491bdf46456cc08936aed69ba45234d092cfd96b.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["stm"]: Refreshing state... [id=archy-f06ed-function-dev-src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-dev-src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-dev-src-0670e2955e9f86836446bb766bcd64a84f94db45.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-31b3d9977309e0c93af950be7988130ce56772d2.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-dev-src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip]
module.dev.google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudErrorLog]
module.dev.google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_generateWelcomeImage]
module.dev.google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_channelMessage]
module.dev.google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_updateUserRole]
module.dev.google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exp]
module.dev.google_cloudfunctions_function.pubsub_function["cloudDeploymentLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudDeploymentLog]
module.dev.google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_privateMessage]
module.dev.google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_frogeOfTheDay]
module.dev.google_cloudfunctions_function.pubsub_function["stm"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_stm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.dev.google_cloudfunctions_function.pubsub_function["channelMessage"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_channelMessage"
        name                  = "dev_channelMessage"
      ~ runtime               = "go119" -> "go121"
      ~ source_archive_object = "src-31b3d9977309e0c93af950be7988130ce56772d2.zip" -> "src-b9c78aa296e3992a534329ee12e9400c1db846c2.zip"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.pubsub_function["cloudDeploymentLog"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_cloudDeploymentLog"
        name                  = "dev_cloudDeploymentLog"
      ~ runtime               = "go119" -> "go121"
      ~ source_archive_object = "src-f5e0c278783c73ab95d630022ac487fe5e220188.zip" -> "src-ba45a2283b0dfbb4403df49a975ffab286eb54ed.zip"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.pubsub_function["cloudErrorLog"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_cloudErrorLog"
        name                  = "dev_cloudErrorLog"
      ~ runtime               = "go119" -> "go121"
      ~ source_archive_object = "src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip" -> "src-c97bdc87edf3230c7f079530555818a0473cc8a2.zip"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.pubsub_function["exp"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_exp"
        name                  = "dev_exp"
      ~ runtime               = "go119" -> "go121"
      ~ source_archive_object = "src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip" -> "src-3b63dbff8ec0fde6c28727f84ce814edcab313f9.zip"
        # (17 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.dev.google_cloudfunctions_function.pubsub_function["privateMessage"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_privateMessage"
        name                  = "dev_privateMessage"
      ~ runtime               = "go119" -> "go121"
      ~ source_archive_object = "src-491bdf46456cc08936aed69ba45234d092cfd96b.zip" -> "src-fea4d40761f0c4d7e4ade9234aff3c676d56b179.zip"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.pubsub_function["stm"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_stm"
        name                  = "dev_stm"
      ~ runtime               = "go119" -> "go121"
      ~ source_archive_object = "src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip" -> "src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_cloudfunctions_function.pubsub_function["updateUserRole"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_updateUserRole"
        name                  = "dev_updateUserRole"
      ~ runtime               = "go119" -> "go121"
      ~ source_archive_object = "src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip" -> "src-70bbdeada9ccdbd989dadcb475dd9947b0cc95c6.zip"
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_compute_instance.default will be updated in-place
  ~ resource "google_compute_instance" "default" {
        id                        = "projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy"
      ~ metadata                  = {
          - "google-monitoring-enabled" = "true" -> null
            # (2 unchanged elements hidden)
        }
        name                      = "e2-micro-archy"
        tags                      = []
      ~ terraform_labels          = {
          + "container-vm" = "cos-stable-97-16919-29-21"
        }
        # (18 unchanged attributes hidden)

      - timeouts {}

        # (5 unchanged blocks hidden)
    }

  # module.dev.google_secret_manager_secret.secret["DISCORD_TOKEN"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "DISCORD_TOKEN"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret["STM_API_KEY"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "STM_API_KEY"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret["TENOR_API_TOKEN"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "TENOR_API_TOKEN"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret["YOUTUBE_API_TOKEN"] will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + effective_labels      = (known after apply)
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "archy-f06ed"
      + secret_id             = "YOUTUBE_API_TOKEN"
      + terraform_labels      = (known after apply)

      + replication {
          + auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret-basic["DISCORD_TOKEN"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2022-11-17T23:10:30.051534Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/DISCORD_TOKEN" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/DISCORD_TOKEN" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "DISCORD_TOKEN" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }

      - timeouts {}
    }

  # module.dev.google_secret_manager_secret.secret-basic["STM_API_KEY"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2023-01-17T22:11:21.722366Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/STM_API_KEY" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/STM_API_KEY" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "STM_API_KEY" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # module.dev.google_secret_manager_secret.secret-basic["TENOR_API_TOKEN"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2022-11-17T23:10:28.920643Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/TENOR_API_TOKEN" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/TENOR_API_TOKEN" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "TENOR_API_TOKEN" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }

      - timeouts {}
    }

  # module.dev.google_secret_manager_secret.secret-basic["YOUTUBE_API_TOKEN"] will be destroyed
  # (because google_secret_manager_secret.secret-basic is not in configuration)
  - resource "google_secret_manager_secret" "secret-basic" {
      - annotations           = {} -> null
      - create_time           = "2022-11-17T22:53:18.875403Z" -> null
      - effective_annotations = {} -> null
      - effective_labels      = {} -> null
      - id                    = "projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN" -> null
      - labels                = {} -> null
      - name                  = "projects/763564183085/secrets/YOUTUBE_API_TOKEN" -> null
      - project               = "archy-f06ed" -> null
      - secret_id             = "YOUTUBE_API_TOKEN" -> null
      - terraform_labels      = {} -> null
      - version_aliases       = {} -> null

      - replication {
          - auto {
            }
        }
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["channelMessage"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "KqNkLQ==" -> (known after apply)
      ~ detect_md5hash   = "+I2g3upzXHqv3nIMST89Qg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-31b3d9977309e0c93af950be7988130ce56772d2.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "+I2g3upzXHqv3nIMST89Qg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-31b3d9977309e0c93af950be7988130ce56772d2.zip?generation=1680617637002127&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-31b3d9977309e0c93af950be7988130ce56772d2.zip" -> "src-b9c78aa296e3992a534329ee12e9400c1db846c2.zip" # forces replacement
      ~ output_name      = "src-31b3d9977309e0c93af950be7988130ce56772d2.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-31b3d9977309e0c93af950be7988130ce56772d2.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["cloudDeploymentLog"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "GGbW8A==" -> (known after apply)
      ~ detect_md5hash   = "yGyX2tjPv8sKCgQMHA2IcA==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-f5e0c278783c73ab95d630022ac487fe5e220188.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "yGyX2tjPv8sKCgQMHA2IcA==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-f5e0c278783c73ab95d630022ac487fe5e220188.zip?generation=1682004339200586&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-f5e0c278783c73ab95d630022ac487fe5e220188.zip" -> "src-ba45a2283b0dfbb4403df49a975ffab286eb54ed.zip" # forces replacement
      ~ output_name      = "src-f5e0c278783c73ab95d630022ac487fe5e220188.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-f5e0c278783c73ab95d630022ac487fe5e220188.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "Qvytjw==" -> (known after apply)
      ~ detect_md5hash   = "suyVVLRQORV4gG1FZ5S1xw==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "suyVVLRQORV4gG1FZ5S1xw==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip?generation=1680617636986632&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip" -> "src-c97bdc87edf3230c7f079530555818a0473cc8a2.zip" # forces replacement
      ~ output_name      = "src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-dcf87a1e3f4a3bd372e0d8d8561a7869fe761a76.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["exp"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "/9XUog==" -> (known after apply)
      ~ detect_md5hash   = "zZSoHxeVLH12iWRhA3G5Jw==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "zZSoHxeVLH12iWRhA3G5Jw==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip?generation=1668726100646281&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip" -> "src-3b63dbff8ec0fde6c28727f84ce814edcab313f9.zip" # forces replacement
      ~ output_name      = "src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-bf9b6bc5ac8335409b2bfb2fbb9be0eb0e116f09.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["privateMessage"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "+HS50Q==" -> (known after apply)
      ~ detect_md5hash   = "86TsVGwKmiVEh8x/5N85vw==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-491bdf46456cc08936aed69ba45234d092cfd96b.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "86TsVGwKmiVEh8x/5N85vw==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-491bdf46456cc08936aed69ba45234d092cfd96b.zip?generation=1680617637000184&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-491bdf46456cc08936aed69ba45234d092cfd96b.zip" -> "src-fea4d40761f0c4d7e4ade9234aff3c676d56b179.zip" # forces replacement
      ~ output_name      = "src-491bdf46456cc08936aed69ba45234d092cfd96b.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-491bdf46456cc08936aed69ba45234d092cfd96b.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["stm"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "ul15Hg==" -> (known after apply)
      ~ detect_md5hash   = "BpJQ6GzTGPbTxmjyJcHozA==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "BpJQ6GzTGPbTxmjyJcHozA==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip?generation=1685206838102583&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip" -> "src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip" # forces replacement
      ~ output_name      = "src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-0e4daeb9e2a2fc2db356eacd81a4736fd6c7a369.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["updateUserRole"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "FQ8R9A==" -> (known after apply)
      ~ detect_md5hash   = "seq/XJPCQxfp5Pt2LVn0aA==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "seq/XJPCQxfp5Pt2LVn0aA==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip?generation=1668651498021803&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip" -> "src-70bbdeada9ccdbd989dadcb475dd9947b0cc95c6.zip" # forces replacement
      ~ output_name      = "src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-93ff48c45ffeafd96931e0b86e287b1336eeeeda.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

Plan: 11 to add, 8 to change, 11 to destroy.

```

</details>

*Pusher: @Mmasson-01, Action: `pull_request`, Workflow: `Terraform plan`*